sample-app/app/controllers/users_controller.rb

  def index
    ActiveSupport::Notifications.subscribe(/[.]aws/) do |name, start, finish, id, _payload|
      Rails.logger.info "Got notification: #{name} #{start} #{finish} #{id}"
    end
    @users = User.all
---
SELECT "users".* FROM "users"